       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBSV003.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT EMPDATA ASSIGN TO VSAMF
             ORGANIZATION IS INDEXED
             ACCESS IS SEQUENTIAL
             RECORD KEY IS EMPDATA-EMPNO.
          SELECT OUTFILE ASSIGN TO SEQTF.
          SELECT SORT-FILE ASSIGN TO SORT01.

       DATA DIVISION.
       FILE SECTION.
       FD EMPDATA 
          LABEL RECORDS ARE STANDARD
          RECORD CONTAINS 120 CHARACTERS.
       01 EMPDATA-REC.
          05 EMPDATA-EMPNO		PIC X(06).
          05 EMPDATA-NAME		PIC X(34).
          05 EMPDATA-WORKDEPT		PIC X(03).
          05 EMPDATA-OTHDETAILS		PIC X(36).
          05 EMPDATA-SALARY 		PIC S9(7)V9(2) USAGE COMP-3.
          05 EMPDATA-BONUS		PIC S9(7)V9(2) USAGE COMP-3.
          05 EMPDATA-RESTOFREC		PIC X(31).
       FD OUTFILE
          LABEL RECORDS ARE STANDARD
          RECORD CONTAINS 120 CHARACTERS. 
       01 OUTREC 			PIC X(120).
       SD SORT-FILE.
       01 SORT-REC			PIC X(120).
          05 FIRSTREC			PIC X(40).
          05 WORKDEPT			PIC X(03).
          05 SECONDREC			PIC X(77).
                      
       PROCEDURE DIVISION.
       100-MAIN-MODULE.
           OPEN OUTPUT OUTFILE
           OPEN INPUT EMPDATA
           SORT SORT-FILE
           	ON ASCENDING KEY WORKDEPT
                USING EMPDATA
                GIVING OUTFILE
           CLOSE OUTFILE 
                 EMPDATA
           STOP RUN.      
           
             
       