       01      DFHBMSCA.                                           
         02    DFHBMPEM  PICTURE X   VALUE  IS  ''.               
         02    DFHBMPNL  PICTURE X   VALUE  IS  'Å'.               
         02    DFHBMASK  PICTURE X   VALUE  IS  '0'.               
         02    DFHBMUNP  PICTURE X   VALUE  IS  ' '.               
         02    DFHBMUNN  PICTURE X   VALUE  IS  '&'.               
         02    DFHBMPRO  PICTURE X   VALUE  IS  '-'.               
         02    DFHBMBRY  PICTURE X   VALUE  IS  'H'.               
         02    DFHBMDAR  PICTURE X   VALUE  IS  '<'.               
         02    DFHBMFSE  PICTURE X   VALUE  IS  'A'.               
         02    DFHBMPRF  PICTURE X   VALUE  IS  '/'.               
         02    DFHBMASF  PICTURE X   VALUE  IS  '1'.               
         02    DFHBMASB  PICTURE X   VALUE  IS  '8'.               
         02    DFHBMEOF  PICTURE X   VALUE  IS  'Ã'.               
         02    DFHBMDET  PICTURE X   VALUE  IS  'ÿ'.               
         02    DFHBMPSO  PICTURE X   VALUE  IS  ''.               
         02    DFHBMPSI  PICTURE X   VALUE  IS  '©'.               
         02    DFHSA     PICTURE X   VALUE  IS  'Ì'.               
         02    DFHCOLOR  PICTURE X   VALUE  IS  'ƒ'.               
         02    DFHPS     PICTURE X   VALUE  IS  '„'.               
         02    DFHHLT    PICTURE X   VALUE  IS  'É'.               
         02    DFH3270   PICTURE X   VALUE  IS  '{'.               
         02    DFHVAL    PICTURE X   VALUE  IS  'A'.               
         02    DFHOUTLN  PICTURE X   VALUE  IS  'B'.               
         02    DFHBKTRN  PICTURE X   VALUE  IS  'ò'.               
         02    DFHALL    PICTURE X   VALUE  IS  ' '.               
         02    DFHERROR  PICTURE X   VALUE  IS  ''.               
         02    DFHDFT    PICTURE X   VALUE  IS  'ÿ'.               
         02    DFHDFCOL  PICTURE X   VALUE  IS  ' '.               
         02    DFHBLUE   PICTURE X   VALUE  IS  '1'.               
         02    DFHRED    PICTURE X   VALUE  IS  '2'.               
         02    DFHPINK   PICTURE X   VALUE  IS  '3'.               
         02    DFHGREEN  PICTURE X   VALUE  IS  '4'.               
         02    DFHTURQ   PICTURE X   VALUE  IS  '5'.               
         02    DFHYELLO  PICTURE X   VALUE  IS  '6'.               
         02    DFHNEUTR  PICTURE X   VALUE  IS  '7'.               
         02    DFHBASE   PICTURE X   VALUE  IS  ' '.               
         02    DFHDFHI   PICTURE X   VALUE  IS  ' '.               
         02    DFHBLINK  PICTURE X   VALUE  IS  '1'.               
         02    DFHREVRS  PICTURE X   VALUE  IS  '2'.               
         02    DFHUNDLN  PICTURE X   VALUE  IS  '4'.               
         02    DFHMFIL   PICTURE X   VALUE  IS  'ì'.               
         02    DFHMENT   PICTURE X   VALUE  IS  ''.               
         02    DFHMFE    PICTURE X   VALUE  IS  'Ê'.               
         02    DFHUNNOD  PICTURE X   VALUE  IS  '('.               
         02    DFHUNIMD  PICTURE X   VALUE  IS  'I'.               
         02    DFHUNNUM  PICTURE X   VALUE  IS  'J'.               
         02    DFHUNINT  PICTURE X   VALUE  IS  'R'.               
         02    DFHUNNON  PICTURE X   VALUE  IS  ')'.               
         02    DFHPROTI  PICTURE X   VALUE  IS  'Y'.               
         02    DFHPROTN  PICTURE X   VALUE  IS  '%'.               
         02    DFHMT     PICTURE X   VALUE  IS  ''.               
         02    DFHMFT    PICTURE X   VALUE  IS  '	'.         
         02    DFHMET    PICTURE X   VALUE  IS  ''.               
         02    DFHMFET   PICTURE X   VALUE  IS  ''.               
         02    DFHDFFR   PICTURE X   VALUE  IS  ' '.               
         02    DFHLEFT   PICTURE X   VALUE  IS  'â'.               
         02    DFHOVER   PICTURE X   VALUE  IS  'ì'.               
         02    DFHRIGHT  PICTURE X   VALUE  IS  ''.               
         02    DFHUNDER  PICTURE X   VALUE  IS  ''.               
         02    DFHBOX    PICTURE X   VALUE  IS  '©'.               
         02    DFHSOSI   PICTURE X   VALUE  IS  ''.               
         02    DFHTRANS  PICTURE X   VALUE  IS  '0'.               
         02    DFHOPAQ   PICTURE X   VALUE  IS  'ÿ'.               
         
                                     